<a href="https://colab.research.google.com/github/SuperDataWorld/Python/blob/main/QCut.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
import pandas as pd

In [24]:
name = ['John','Paul','Jane','Mike','Tony','Mary','Ben','Lynda','Lynne','Tory','Judy','Carl']
score = [20,90,80,77,0,55,10,88,87,78,98,100]
df = pd.DataFrame({'name':name, 'score':score})
df

     name  score
0    John     20
1    Paul     90
2    Jane     80
3    Mike     77
4    Tony      0
5    Mary     55
6     Ben     10
7   Lynda     88
8   Lynne     87
9    Tory     78
10   Judy     98
11   Carl    100

In [25]:
pd.cut(df.score,4)

0      (-0.1, 25.0]
1     (75.0, 100.0]
2     (75.0, 100.0]
3     (75.0, 100.0]
4      (-0.1, 25.0]
5      (50.0, 75.0]
6      (-0.1, 25.0]
7     (75.0, 100.0]
8     (75.0, 100.0]
9     (75.0, 100.0]
10    (75.0, 100.0]
11    (75.0, 100.0]
Name: score, dtype: category
Categories (4, interval[float64]): [(-0.1, 25.0] < (25.0, 50.0] < (50.0, 75.0] < (75.0, 100.0]]

In [30]:
pd.qcut(df.score,4)

0     (-0.001, 46.25]
1       (88.5, 100.0]
2        (79.0, 88.5]
3       (46.25, 79.0]
4     (-0.001, 46.25]
5       (46.25, 79.0]
6     (-0.001, 46.25]
7        (79.0, 88.5]
8        (79.0, 88.5]
9       (46.25, 79.0]
10      (88.5, 100.0]
11      (88.5, 100.0]
Name: score, dtype: category
Categories (4, interval[float64]): [(-0.001, 46.25] < (46.25, 79.0] < (79.0, 88.5] < (88.5, 100.0]]

In [27]:
df['Quartile'] = pd.qcut(df['score'],4,['1stQ','2ndQ','3rdQ','4thQ'])
df

     name  score Quartile
0    John     20     1stQ
1    Paul     90     4thQ
2    Jane     80     3rdQ
3    Mike     77     2ndQ
4    Tony      0     1stQ
5    Mary     55     2ndQ
6     Ben     10     1stQ
7   Lynda     88     3rdQ
8   Lynne     87     3rdQ
9    Tory     78     2ndQ
10   Judy     98     4thQ
11   Carl    100     4thQ

In [28]:
df[df['Quartile'] == '4thQ']

    name  score Quartile
1   Paul     90     4thQ
10  Judy     98     4thQ
11  Carl    100     4thQ

In [29]:
pd.get_dummies(df, columns=df.columns[2:])

     name  score  Quartile_1stQ  Quartile_2ndQ  Quartile_3rdQ  Quartile_4thQ
0    John     20              1              0              0              0
1    Paul     90              0              0              0              1
2    Jane     80              0              0              1              0
3    Mike     77              0              1              0              0
4    Tony      0              1              0              0              0
5    Mary     55              0              1              0              0
6     Ben     10              1              0              0              0
7   Lynda     88              0              0              1              0
8   Lynne     87              0              0              1              0
9    Tory     78              0              1              0              0
10   Judy     98              0              0              0              1
11   Carl    100              0              0              0              1